In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import OneHotEncoder

mengimport library yang dibutuhkan untuk menjalakannya.

In [6]:
df = pd.read_csv("tsunami_dataset.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2259 entries, 0 to 2258
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        2259 non-null   int64
 1   YEAR                      2259 non-null   int64
 2   MONTH                     2155 non-null   float64
 3   DAY                       2082 non-null   float64
 4   HOUR                      1308 non-null   float64
 5   MINUTE                    1235 non-null   float64
 6   LATITUDE                  2259 non-null   float64
 7   LONGITUDE                 2259 non-null   float64
 8   LOCATION_NAME             2250 non-null   object
 9   COUNTRY                   2259 non-null   object
 10  REGION                    2258 non-null   object
 11  CAUSE                     2258 non-null   object
 12  EVENT_VALIDITY            2259 non-null   object
 13  EQ_MAGNITUDE              1474 non-null   float64
 14  EQ_DEPTH                  907 non-null    float64
 15  TS_INTENSITY              1101 non-null   float64
 16  DAMAGE_TOTAL_DESCRIPTION  1055 non-null   object
 17  HOUSES_TOTAL_DESCRIPTION  606 non-null    object
 18  DEATHS_TOTAL_DESCRIPTION  674 non-null    object
 19  URL                       2259 non-null   object
 20  COMMENTS                  2095 non-null   object
dtypes: float64(9), int64(2), object(10)
memory usage: 370.7+ KB

### membagi dua variabel yaitu x dan y
Bagi dataset menjadi training set dan testing set dengan proporsi 70:30

In [7]:
x = df.iloc[:, : -1]
y = df.iloc[:, -1]
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3)
print("Pembagian Dataset Tsunami_dataset.csv : ")
print("Dimensi X_train", x_train.shape)
print("Dimensi X_test", x_test.shape)
print("Dimensi y_train", y_train.shape)
print("Dimensi y_test", y_test.shape)

Pembagian Dataset Tsunami_dataset.csv :
Dimensi X_train (1581, 20)
Dimensi X_test (678, 20)
Dimensi y_train (1581,)
Dimensi y_test (678,)

### Normalisasi
Lakukan normalisasi data pada salah satu attribute menggunakan Min Max scaler

In [8]:
data = df[["YEAR"]]
data.columns = ["YEAR"]
min_max_scaler = MinMaxScaler()
arr = min_max_scaler.fit_transform(data[["YEAR"]])
data_normalisasi = pd.DataFrame(arr)
data_normalisasi.columns =["Year_normalization"]
data = data.join(data_normalisasi["Year_normalization"]).reset_index()
data = data.drop("index", axis=1)
data.head()

   YEAR  Year_normalization
0  -330            0.415423
1  1764            0.936318
2   859            0.711194
3  1580            0.890547
4 -1300            0.174129

### Standarisasi
Lakukan standarisasi pada dataset.

In [9]:
data_standarisasi = df.select_dtypes(include='number')

standard_scaler = StandardScaler()
arrStandarisasi = standard_scaler.fit_transform(data_standarisasi)
dfStandarisasi = pd.DataFrame(arrStandarisasi)
dfStandarisasi.columns = ["IDS", "YEARS", "MONTHS", "DAYS", "HOURS", "MINUTES", "EQ_MAGNITUDES", "EQ_DEPTHS", "TS_INTENSITYS", "LATITUDES", "LONGITUDES" ]

print("<===Perbandingan sebelum melakukan  standar devirasi : ===>")
np.std(data_standarisasi)

<===Perbandingan sebelum melakukan  standar devirasi : ===>

ID              1664.805803
YEAR             354.003306
MONTH              3.459295
DAY                8.654889
HOUR               6.976920
MINUTE            17.216186
LATITUDE          27.724706
LONGITUDE        104.582214
EQ_MAGNITUDE       0.795855
EQ_DEPTH          41.075884
TS_INTENSITY       1.839963
dtype: float64

In [10]:
print("<===Perbandingan sesudah melakukan standar devirasi : ===>")
np.std(dfStandarisasi)

<===Perbandingan sesudah melakukan standar devirasi : ===>

IDS              1.0
YEARS            1.0
MONTHS           1.0
DAYS             1.0
HOURS            1.0
MINUTES          1.0
EQ_MAGNITUDES    1.0
EQ_DEPTHS        1.0
TS_INTENSITYS    1.0
LATITUDES        1.0
LONGITUDES       1.0
dtype: float64

### Data Cleaning
Lakukan Data cleaning pada data dengan nilai null (jika tidak ada nilai null pada dataset, maka buatlah menjadi ada). Ganti nilai null sesuai ketentuan. (bilangan bulat : median/modus, bilangan desimal : mean, tulisan : modus). Nilai plus jika strategy yang digunakan menggunakan 3 nilai

In [11]:
import random

dfBroken = df.select_dtypes(include='number')
ix = [(row, col) for row in range(dfBroken.shape[0]) for col in range(dfBroken.shape[1])]
for row, col in random.sample(ix, int(round(.1*len(ix)))):
    dfBroken.iat[row, col] = np.nan
    
dfBroken.head()

,ID,YEAR,MONTH,DAY,HOUR,MINUTE,LATITUDE,LONGITUDE,EQ_MAGNITUDE,EQ_DEPTH,TS_INTENSITY
0,12.0,-330.0,NaN,NaN,NaN,NaN,40.00,25.000,7.0,NaN,NaN
1,481.0,1764.0,2.0,11.0,NaN,NaN,51.45,-2.583,NaN,NaN,NaN
2,71.0,859.0,NaN,NaN,NaN,NaN,36.08,36.250,NaN,NaN,3.0
3,186.0,1580.0,1.0,NaN,NaN,NaN,40.00,128.000,NaN,NaN,1.0
4,5.0,-1300.0,NaN,NaN,NaN,NaN,39.96,26.240,6.0,NaN,5.0

In [12]:
dfBroken.isna().sum()

ID               206
YEAR             234
MONTH            317
DAY              379
HOUR            1099
MINUTE          1155
LATITUDE         210
LONGITUDE        247
EQ_MAGNITUDE     951
EQ_DEPTH        1436
TS_INTENSITY    1270
dtype: int64

### Cara Mengatasi Nilai Null

In [13]:
dfBroken.dtypes

ID              float64
YEAR            float64
MONTH           float64
DAY             float64
HOUR            float64
MINUTE          float64
LATITUDE        float64
LONGITUDE       float64
EQ_MAGNITUDE    float64
EQ_DEPTH        float64
TS_INTENSITY    float64
dtype: object

In [14]:
imputer = SimpleImputer(strategy = "mean")
arr = imputer.fit_transform(dfBroken)
dfSubtitusi = pd.DataFrame(arr)
dfSubtitusi.columns = ["IDS", "YEARS", "MONTHS", "DAYS", "HOURS", "MINUTES", "EQ_MAGNITUDES", "EQ_DEPTHS", "TS_INTENSITYS", "LATITUDES", "LONGITUDES" ]
print("dateset yang sudah dibersihkan : \n")
dfSubtitusi.isna().sum()

dateset yang sudah dibersihkan :

IDS              0
YEARS            0
MONTHS           0
DAYS             0
HOURS            0
MINUTES          0
EQ_MAGNITUDES    0
EQ_DEPTHS        0
TS_INTENSITYS    0
LATITUDES        0
LONGITUDES       0
dtype: int64

In [24]:
dfSubtitusi.head(20)

,IDS,YEARS,MONTHS,DAYS,HOURS,MINUTES,EQ_MAGNITUDES,EQ_DEPTHS,TS_INTENSITYS,LATITUDES,LONGITUDES
0,12.0,-330.000000,6.654995,15.789362,11.35,28.341486,40.000000,25.000000,7.000000,36.577157,1.383782
1,481.0,1764.000000,2.000000,11.000000,11.35,28.341486,51.450000,-2.583000,7.044037,36.577157,1.383782
2,71.0,859.000000,6.654995,15.789362,11.35,28.341486,36.080000,36.250000,7.044037,36.577157,3.000000
3,186.0,1580.000000,1.000000,15.789362,11.35,28.341486,40.000000,128.000000,7.044037,36.577157,1.000000
4,5.0,-1300.000000,6.654995,15.789362,11.35,28.341486,39.960000,26.240000,6.000000,36.577157,5.000000
5,22.0,-47.000000,9.000000,15.789362,11.35,28.341486,37.500000,119.500000,7.044037,36.577157,1.383782
6,174.0,1556.000000,10.000000,21.000000,11.35,28.341486,17.094879,126.000000,7.044037,36.577157,0.500000
7,255.0,1641.000000,12.000000,21.000000,11.35,28.341486,38.400000,40.558279,7.044037,36.577157,1.383782
8,427.0,1818.606914,6.654995,15.789362,11.35,28.341486,33.100000,139.800000,7.044037,36.577157,0.500000
9,219.0,1606.000000,1.000000,23.000000,11.35,28.341486,31.900000,40.558279,7.044037,36.577157,1.383782
10,480.0,1763.000000,9.000000,18.000000,11.35,28.341486,50.600000,-2.466000,7.044037,36.577157,1.383782
11,368.0,1704.000000,6.654995,15.789362,11.35,28.341486,33.600000,136.000000,7.044037,36.577157,1.000000
12,470.0,1761.000000,8.000000,14.000000,11.35,28.341486,49.465000,-2.585000,7.044037,36.577157,1.383782
13,472.0,1762.000000,5.000000,26.000000,11.35,28.341486,60.383000,40.558279,7.044037,36.577157,1.383782
14,277.0,1653.000000,6.654995,15.789362,11.35,28.341486,38.400000,-27.100000,7.044037,36.577157,1.383782
15,302.0,1668.000000,11.000000,23.000000,11.35,28.341486,38.500000,-28.100000,7.044037,36.577157,1.383782
16,403.0,1732.000000,6.654995,15.789362,11.35,28.341486,33.100000,139.767000,7.044037,36.577157,1.383782
17,97.0,1099.000000,11.000000,11.000000,11.35,28.341486,50.116000,-5.483000,7.044037,36.577157,1.383782
18,81.0,975.000000,6.654995,15.789362,11.35,28.341486,17.094879,28.980000,7.044037,36.577157,1.383782
19,130.0,1818.606914,8.000000,23.000000,11.35,28.341486,38.000000,40.558279,7.044037,36.577157,0.000000

In [16]:
dfDouble = pd.concat([df]*2, ignore_index=True)
dfDouble.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4513     True
4514     True
4515     True
4516     True
4517     True
Length: 4518, dtype: bool

In [17]:
print("jumlah dataset yang duplikat :")
dfDouble.duplicated().sum()

junmlah dataset yang sudah di duplikat :

2259

### Cara Mengatasi Data yang Duplikat

In [26]:
dfDouble.drop_duplicates(inplace=True)
dfDouble.duplicated()
print("jumlah dataset yang sudah dibersihkan duplikat :")
dfDouble.duplicated().sum()

jumlah dataset yang sudah dibersihkan duplikat :

0

### Mengubah tipe data dari salah satu angka di dataset

In [27]:
print("data keseluruhan :")
df.dtypes

data keseluruhan :

ID                            int64
YEAR                          int64
MONTH                       float64
DAY                         float64
HOUR                        float64
MINUTE                      float64
LATITUDE                    float64
LONGITUDE                   float64
LOCATION_NAME                object
COUNTRY                      object
REGION                       object
CAUSE                        object
EVENT_VALIDITY               object
EQ_MAGNITUDE                float64
EQ_DEPTH                    float64
TS_INTENSITY                float64
DAMAGE_TOTAL_DESCRIPTION     object
HOUSES_TOTAL_DESCRIPTION     object
DEATHS_TOTAL_DESCRIPTION     object
URL                          object
COMMENTS                     object
dtype: object

In [20]:
print("<== sebelum ==>")
df["YEAR"].dtypes

<== sebelum ==>

dtype('int64')

In [21]:
print("<== sesudah ==>")
dfSesudah = df[["YEAR"]].astype("object")
dfSesudah["YEAR"].dtypes

<== sesudah ==>

dtype('O')

### One Hot Encoding

In [22]:
df.columns

Index(['ID', 'YEAR', 'MONTH', 'DAY', 'HOUR', 'MINUTE', 'LATITUDE', 'LONGITUDE',
       'LOCATION_NAME', 'COUNTRY', 'REGION', 'CAUSE', 'EVENT_VALIDITY',
       'EQ_MAGNITUDE', 'EQ_DEPTH', 'TS_INTENSITY', 'DAMAGE_TOTAL_DESCRIPTION',
       'HOUSES_TOTAL_DESCRIPTION', 'DEATHS_TOTAL_DESCRIPTION', 'URL',
       'COMMENTS'],
      dtype='object')

In [23]:
df.columns = ['ID', 'YEAR', 'MONTH', 'DAY', 'HOUR', 'MINUTE', 'LATITUDE', 'LONGITUDE',
       'LOCATION_NAME', 'COUNTRY', 'REGION', 'CAUSE', 'EVENT_VALIDITY',
       'EQ_MAGNITUDE', 'EQ_DEPTH', 'TS_INTENSITY', 'DAMAGE_TOTAL_DESCRIPTION',
       'HOUSES_TOTAL_DESCRIPTION', 'DEATHS_TOTAL_DESCRIPTION', 'URL',
       'COMMENTS']

oh_encoder = OneHotEncoder(sparse=False)
onehot= oh_encoder.fit_transform(df[["REGION"]])

df_onehot= pd.DataFrame(onehot)
df_last = df.join(df_onehot)

df_last.head()

,ID,YEAR,MONTH,DAY,HOUR,MINUTE,LATITUDE,LONGITUDE,LOCATION_NAME,COUNTRY,...,13,14,15,16,17,18,19,20,21,22
0,12,-330,NaN,NaN,NaN,NaN,40.00,25.000,"E. SPORADES ISLANDS, AEGEAN ISLANDS",GREECE,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,481,1764,2.0,11.0,NaN,NaN,51.45,-2.583,"BRISTOL, ENGLAND",UK,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,71,859,NaN,NaN,NaN,NaN,36.08,36.250,SAMANDAGI,TURKEY,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,186,1580,1.0,NaN,NaN,NaN,40.00,128.000,YELLOW SEA,NORTH KOREA,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,-1300,NaN,NaN,NaN,NaN,39.96,26.240,"IONIAN COASTS, TROAD",TURKEY,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0